app/Models/PelayananModel.php

  public function noPendaftaran()
  {
    $kode = $this->db->table('pelayanan')
      ->select('RIGHT(kode,2) as kode', false)
      ->orderBy('kode', 'DESC')
      ->limit(1)->get()->getRowArray();
---
SELECT RIGHT(kode, 2) as kode
FROM `pelayanan`
ORDER BY `kode` DESC
 LIMIT 1

  public function id()
  {

    $kode = $this->db->table('pelayanan')
            -> select('MAX(id) AS id', false)
            -> orderBy('id','DESC')
            ->limit(1)->get()->getRowArray();
---
SELECT MAX(id) AS id
FROM `pelayanan`
ORDER BY `id` DESC
 LIMIT 1